app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
    @states = State.all
---
SELECT `tasks`.* FROM `tasks`
SELECT `states`.* FROM `states`

  def new
    @task = Task.new
    @states = State.all
---
SELECT `states`.* FROM `states`

  def edit
    @states = State.all
---
SELECT `states`.* FROM `states`

  def create
    @task = Task.new(task_params)
    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`created_at`, `state_id`, `title`, `updated_at`) VALUES ('2017-11-01 20:02:31', 1, 'Hrml', '2017-11-01 20:02:31')

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE `tasks` SET `title` = '17', `updated_at` = '2017-11-06 17:59:26' WHERE `tasks`.`id` = 17

  def destroy
    @task.destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 1

  def update_all
    state = Task.update_all_json
---
UPDATE `tasks` SET `state_id` = NULL, `updated_at` = '2017-11-02 22:24:26' WHERE `tasks`.`id` = 66

  def delete_complited
    response = Task.delete_complited_json
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 24

    def set_task
      @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks`  WHERE `tasks`.`id` = 32 LIMIT 1